{
	"paragraphs": [
		"Hello, potential employer or stalker. My name is Josh Rogan (20), however you must have known that to get onto this webpage. I am currently attending the <a href='http://www.scranton.edu/academics/index.shtml' target='_blank'> University of Scranton</a> as a Computer Science major (Academic Junior). I have made the dean's list three times and have a near 4.0 in Computer Science courses. So far I have studied topics ranging from basic programming to data structures and machine language.",
		"I currently work at the Technology Support Center on the <a href='http://www.scranton.edu/pir/its/resnet/index.shtml' target='_blank'> Residential Network</a> (ResNet) where I repair and tune-up laptops and perform other general tech support. I specialize in virus remediation: removing any types of <a href='http://www.pcmag.com/article2/0,2817,2379663,00.asp' target='_blank'>  malware, spyware, viruses, rootkits</a> ,  etc. This job has given me a high degree of experience in virtually all areas of technical support.",
		"I also work at the Center for Teaching and Learning Excellence as a <a href='http://www.scranton.edu/academics/ctle/Techcons/index.shtml' target='_blank'> Technical Consultant</a>. There I assist professors and faculty with technical problems relating to technology in the classroom. I do a large amount of video editing using <a href='http://www.techsmith.com/camtasia.html' target='_blank'>Camtasia</a>, <a href='http://www.adobe.com/products/premiere.html' target='_blank'>Adobe Premiere Pro CS6</a>, and <a href='http://www.realnetworks.com/helix/video-encoding-with-helix-producer/' target='_blank'>Helix Producer</a>. We offer training to professors to use our learning management system (currently <a href='http://en.wikipedia.org/wiki/ANGEL_Learning' target='_blank'>Angel</a>). I am also the student representative on the committee appointed to decide what our next learning management system will be (<a href='http://www.blackboard.com/' target='_blank'>Blackboard</a>, <a href='http://www.desire2learn.com/' target='_blank'>Desire2Learn</a>, or <a href='http://www.instructure.com/' target='_blank'>Canvas</a>). We are responsible for creating and managing webpages for faculty and organizations. We meet bi-weekly to create professional development projects. These projects are how we communicate with the campus about forms of technology that are helpful in the classroom. We operate on a yearlong basis in both individual and group settings. Some examples of the topics we covered are iTunesU, <a href='http://en.wikipedia.org/wiki/Cloud_storage' target='_blank'>Cloud Storage</a> (SkyDrive, dropbox, Icloud etc.), screen sharing software (<a href='http://join.me' target='_blank'>join.me</a>), and upcoming operating systems such as <a href='http://windows.microsoft.com/en-us/windows-8/meet' target='_blank'>Windows 8</a>. ",
		"Please enjoy this site that I built from the ground up. I feel that it speaks for itself as an example of my web development capabilities. All data through the site are in <a href='http://json.org/' target='_blank'>JSON</a> files, processed server side through <a href='http://php.net' target='_blank'>PHP</a> (available to <a href='http://overapi.com/javascript/' target='_blank'>JavaScript</a> too), and displayed on the front end with <a href='http://www.html5rocks.com/en/' target='_blank'>HTML5/CSS3</a> helped with<a href='http://jquery.com/' target='_blank'>JQuery</a>. Because everything is in JSON format, I am easily able to produce a printable resume on one page without duplicating any data. I chose the option of JSON instead of a database like <a href='http://www.mysql.com/' target='_blank'>SQL</a> because the files don't lend themselves to a database; there just isn't enough data. I also used PHP's <a href='http://httpd.apache.org/docs/2.2/howto/htaccess.html' target='_blank'>Mod-Rewrite</a> to create links and directories through the site.  Personally, my favorite aspect of the website is the quote generator that randomly picks one of my favorite quotes."
	]
}


